assets/placetolatlong.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:msr="http://msrmaps.com/">
   <soapenv:Header/>
   <soapenv:Body>
      <msr:ConvertPlaceToLonLatPt>
         <msr:place>
            <msr:City>Albany</msr:City>
            <msr:State>New York</msr:State>
            <msr:Country>USA</msr:Country>
         </msr:place>
      </msr:ConvertPlaceToLonLatPt>
   </soapenv:Body>
</soapenv:Envelope>